# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [23]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [24]:
series1 = pd.Series(np.random.randint(1, 5, size=100), name='Random_1_to_4')

print("Random Numbers (1-4):")
series1.head()

Random Numbers (1-4):

0    3
1    1
2    4
3    1
4    1
Name: Random_1_to_4, dtype: int32

In [25]:
series2 = pd.Series(np.random.randint(1, 4, size=100), name='Random_1_to_3')

print("Random Numbers (1-3):")
series2.head()

Random Numbers (1-3):

0    3
1    3
2    1
3    1
4    1
Name: Random_1_to_3, dtype: int32

In [26]:
series3 = pd.Series(np.random.randint(10000, 30001, size=100), name='Random_10K_to_30K')

print("Random Numbers (10,000-30,000):")
series3.head()

Random Numbers (10,000-30,000):

0    15234
1    16004
2    24517
3    10398
4    15436
Name: Random_10K_to_30K, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [27]:
df = pd.concat([series1, series2, series3], axis=1)

print("Combined DataFrame:")
df.head()

Combined DataFrame:

   Random_1_to_4  Random_1_to_3  Random_10K_to_30K
0              3              3              15234
1              1              3              16004
2              4              1              24517
3              1              1              10398
4              1              1              15436

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [28]:
bedrs = pd.Series(np.random.randint(1, 5, size=100), name='bedrs')          # 1-4 bedrooms
bathrs = pd.Series(np.random.randint(1, 4, size=100), name='bathrs')        # 1-3 bathrooms
price_sqr_meter = pd.Series(np.random.randint(10000, 30001, size=100),      # 10,000-30,000 price/sqm
                           name='price_sqr_meter')

property_df = pd.concat([bedrs, bathrs, price_sqr_meter], axis=1)

print("Property Data:")
property_df.head()

Property Data:

   bedrs  bathrs  price_sqr_meter
0      4       1            21629
1      2       2            20290
2      3       2            10366
3      3       3            23129
4      2       2            18030

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [29]:
bigcolumn = pd.concat([bedrs, bathrs, price_sqr_meter], axis=0).to_frame('bigcolumn')
bigcolumn.head(10)

   bigcolumn
0          4
1          2
2          3
3          3
4          2
5          1
6          1
7          4
8          3
9          4

In [30]:
bigcolumn.tail(10)

    bigcolumn
90      15223
91      19077
92      29393
93      29590
94      29947
95      23260
96      23576
97      11266
98      22474
99      12645

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [31]:
#That's correct, it only goes up until index 99.

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [32]:
bigcolumn = pd.concat([bedrs, bathrs, price_sqr_meter], axis=0) \
             .to_frame('bigcolumn') \
             .reset_index(drop=True)

bigcolumn.tail(10)

     bigcolumn
290      15223
291      19077
292      29393
293      29590
294      29947
295      23260
296      23576
297      11266
298      22474
299      12645

In [33]:
bigcolumn.head()

   bigcolumn
0          4
1          2
2          3
3          3
4          2